https://www.acmicpc.net/problem/1966 프린터 큐 문제

* 문제 분석
1. 입력/처리/출력할 데이터 유형 및 타입
  1) 테스트 케이스 갯수 
  2) 문서의 갯수 N(1 <= n <= 100)와 탐색 대상 문서의 순서 M(0 <= M < 100)
  3) 문서의 중요도(prioriy) P(1 <= P <= 9)
  
  : 입력 및 출력 데이터의 타입은 모두 정수형이다.
  
2. 자료 구조 정의 (어떤 자료 구조가 필요한가? 자료 구조의 명칭 또한 코드를 이해하는데 도움을 준다.)
  1) 문서의 요청 순번(request sequence)과 중요도(prioriy) 2개의 숫자를 가진 구조체 혹은 객체
     인쇄 요청 문서에 대한 정보를 저장하는 객체이며, 인쇄 큐 : printRequest라고 명명하자.
  2) 프린터에 전달된 문서 인쇄 요청 정보를 저장할 큐(queue)
     printRequestQueue라고 명명하자.
  3) 인쇄 요청 문서의 출력된 순서 정보를 저장하는 배열 (최종적으로 출력된 순서를 기록하고, 이후에 대상 문서의 출력 순서를 확인하는 용도)
     printResultArray 라고 명명하자.
  
3. 알고리즘 (혹은 논리) 정리
  1) 문서의 요청 순번와 중요도를 입력 받아 (문서의 순서는 입력 값을 읽는 loop의 index 변수를 이용해 자동 생성), 큐에 저장해야 한다.
  2) 큐에 저장된 인쇄 작업 요청을 순회(traverse)하면서 문서 인쇄를 시뮬레이션 한다.
    2-1) 첫째, 큐에서 가장 앞의 문서의 중요도를 검사하여, 가장 앞선 문서 중요도 보다 큐의 남은 부분(후순위)에 존재하는 문서의 중요도가 높으면 특정 위치의 문서를 마지막 위치에 재배치 한다.
    2-2) 둘째, 가장 앞의 문서의 중요도가 가장 높은 것으로 판단되면, 문서를 출력하고 출력된 문서의 요청 순번을 별도의 자료 구조(출력 순서 혹은 print sequence)에 기록해둔다.
	2-3) 셋째, 큐에 남은 데이터가 없어질 때까지 2-1부터 2-2의 과정을 반복한다.
  3) 문서의 출력 순서를 기록한 print sequence 자료 구조에서 테스트 케이스에서 입력 받은 문서의 순서(M)가 최종적으로 어떤 순번으로 출력되었는지 출력 순번을 찾아 화면에 출력한다.
  4) 테스트 케이스 갯수 만큼 1부터 3까지의 과정을 반복한다.
  
4. 생각해 봐야 할 점
  1) 문제에서 큐(queue) 자료 구조를 사용한다고 했는데, 큐의 특징은 저장된 데이터의 중간 지점에 접근할 수 없다.
     따라서, 큐에 담겨진 문서들의 순서를 재배치하거나 뒤섞는(re-ordering or shuffle)하는 방식은 고려하지 않는게 낫다.
  2) 출력되는 순서를 확인하고자 하는 것이니, 출력되는 과정을 시뮬레이션하는 방식으로 접근해 볼 수 있다.
     그러니 출력된 순서를 별도의 자료 구조에 저장해 두고, 출력된 순서를 탐색해 답을 찾는다.

5. 문제 구조화 과정 (의사 코드 작성)
  : 주어진 문제를 풀어가는 과정을 의사 코드(pseudo code)로 작성해보는 것은 논리적인 전재가 명확한지 스스로 검증하는데 있어서 유리하다.
    아울러 프로그램을 제작하기 전에 동료 리뷰를 거쳐 문제점은 없는지, 다른 접근 방식에 대한 의견 수렴 과정을 거칠 수도 있다.
    개발 이후에는 자신의 의도를 기록해두어 회고(remind)하는데도 유용하다.

  5-1) 화면에서 테스트 케이스 갯수, 문서의 갯수, 탐색 대상 문서 순서 등을 입력 받는다. 화면에서 입력 받은 데이터를 변수(혹은 자료 구조)에 담아 둔다.
  5-2) 입력 데이터를 담은 변수를 출력 순서를 결정하는 인쇄 스케줄러(print scheduler) 함수에 전달한다.
       인쇄 스케줄러 함수는 출력 순서를 최종 결정한 출력 순서를 담은 자료 구조(printResultArray)를 반환한다.
	   (printScheduler 함수는 2-1, 2-2 단계의 로직을 구현한다.)
  5-3) 출력 순서가 담긴 자료 구조(printResultArray)에서 대상 문서 M의 출력 순서를 찾아 화면에 출력한다.
  
